export const verbLogic = [
  {
    name: '현재진행형',
    key: 'present_continuous',
    value: [
      {
        id: '1',
        name: '안하고있다',
        value: {
          '1': {
            u: 'っていない',
            ku: 'いていない',
            gu: 'いでいない',
            su: 'していない',
            tsu: 'っていない',
            nu: 'んでいない',
            mu: 'んでいない',
            ru: 'っていない',
            bu: 'んでいない',
          },
          '2': {
            ru: 'ていない',
          },
          '3': {
            suru: 'していない',
          },
        },
      },
      {
        id: '2',
        name: '하고있다',
        value: {
          '1': {
            u: 'っている',
            ku: 'いている',
            gu: 'いでいる',
            su: 'している',
            tsu: 'っている',
            nu: 'んでいる',
            mu: 'んでいる',
            ru: 'っている',
            bu: 'んでいる',
          },
          '2': {
            ru: 'ている',
          },
          '3': {
            suru: 'している',
          },
        },
      },
    ],
  },
  {
    name: '현재형',
    key: 'present',
    value: [
      {
        id: '5phbn3mf7fawqtg',
        name: '합니다',
        value: {
          '1': {
            u: 'います',
            ku: 'きます',
            gu: 'ぎます',
            su: 'します',
            tsu: 'ちます',
            nu: 'にます',
            hu: 'ひます',
            mu: 'みます',
            ru: 'ります',
            bu: 'びます',
          },
          '2': {
            ru: 'ます',
          },
          '3': {
            suru: 'します',
          },
        },
      },
      {
        id: 'ig9qx80r8gabe7z',
        name: '안하다',
        value: {
          '1': {
            u: 'わない',
            ku: 'かない',
            gu: 'がない',
            su: 'さない',
            tsu: 'たない',
            nu: 'なない',
            mu: 'まない',
            ru: 'らない',
            bu: 'ばない',
          },
          '2': {
            ru: 'ない',
          },
          '3': { suru: 'しない' },
        },
      },
      {
        id: 'tq2bvormsz0wg51',
        name: '안합니다',
        value: {
          '1': {
            u: 'いません',
            ku: 'きません',
            gu: 'ぎません',
            su: 'しません',
            tsu: 'ちません',
            nu: 'にません',
            hu: 'ひません',
            mu: 'みません',
            ru: 'りません',
            bu: 'びません',
          },
          '2': {
            ru: 'ません',
          },
          '3': { suru: 'しません' },
        },
      },
      {
        id: 'yvjc5skmctran9y',
        name: '하고싶다',
        value: {
          '1': {
            u: 'いたい',
            ku: 'きたい',
            gu: 'ぎたい',
            su: 'したい',
            tsu: 'ちたい',
            nu: 'にたい',
            hu: 'ひたい',
            mu: 'みたい',
            ru: 'りたい',
            bu: 'びたい',
          },
          '2': {
            ru: 'たい',
          },
          '3': { suru: 'したい' },
        },
      },
      {
        id: 'h32cecemtyhutjc',
        name: '하고싶지않다',
        value: {
          '1': {
            u: 'いたくない',
            ku: 'きたくない',
            gu: 'ぎたくない',
            su: 'したくない',
            tsu: 'ちたくない',
            nu: 'にたくない',
            hu: 'ひたくない',
            mu: 'みたくない',
            ru: 'りたくない',
            bu: 'びたくない',
          },
          '2': {
            ru: 'たくない',
          },
          '3': { suru: 'したくない' },
        },
      },
      {
        id: 'nitxxxu3e2eoqsq',
        name: '할수없다',
        value: {
          '1': {
            u: 'えない',
            ku: 'けない',
            gu: 'げない',
            su: 'せない',
            tsu: 'てない',
            nu: 'ねない',
            hu: 'へない',
            mu: 'めない',
            ru: 'れない',
            bu: 'べない',
          },
          '2': {
            ru: 'られない',
          },
          '3': { suru: 'できない' },
        },
      },
      {
        id: '6qtib5ak09x7rxu',
        name: '할수있다',
        value: {
          '1': {
            u: 'える',
            ku: 'ける',
            gu: 'げる',
            su: 'せる',
            tsu: 'てる',
            nu: 'ねる',
            hu: 'へる',
            mu: 'める',
            ru: 'れる',
            bu: 'べる',
          },
          '2': {
            ru: 'られる',
          },
          '3': { suru: 'できる' },
        },
      },
      {
        id: '',
        name: '합시다, ~하죠',
        value: {
          '1': {
            u: 'いましょう',
            ku: 'きましょう',
            gu: 'ぎましょう',
            su: 'しましょう',
            tsu: 'ちましょう',
            nu: 'にましょう',
            hu: 'ひましょう',
            mu: 'みましょう',
            ru: 'りましょう',
            bu: 'びましょう',
          },
          '2': {
            ru: 'ましょう',
          },
          '3': { suru: 'しましょう' },
        },
      },
      {
        id: '',
        name: '~하기쉽다',
        value: {
          '1': {
            u: 'いやすい',
            ku: 'きやすい',
            gu: 'ぎやすい',
            su: 'しやすい',
            tsu: 'ちやすい',
            nu: 'にやすい',
            hu: 'ひやすい',
            mu: 'みやすい',
            ru: 'りやすい',
            bu: 'びやすい',
          },
          '2': {
            ru: 'やすい',
          },
          '3': { suru: 'しやすい' },
        },
      },
      {
        id: '',
        name: '~하기 어렵다',
        value: {
          '1': {
            u: 'いにくい',
            ku: 'きにくい',
            gu: 'ぎにくい',
            su: 'しにくい',
            tsu: 'ちにくい',
            nu: 'ににくい',
            hu: 'ひにくい',
            mu: 'みにくい',
            ru: 'りにくい',
            bu: 'びにくい',
          },
          '2': {
            ru: 'にくい',
          },
          '3': { suru: 'しにくい' },
        },
      },
      {
        id: '',
        name: '한적이 있습니다',
        value: {
          '1': {
            u: 'ったことがあります',
            ku: 'いたことがあります',
            gu: 'いだことがあります',
            su: 'したことがあります',
            tsu: 'ったことがあります',
            nu: 'んだことがあります',
            mu: 'んだことがあります',
            ru: 'ったことがあります',
            bu: 'んだことがあります',
          },
          '2': {
            ru: 'たことがあります',
          },
          '3': { suru: 'したことがあります' },
        },
      },
    ],
  },
  {
    name: '과거형',
    key: 'past',
    value: [
      {
        id: '3qdu711ver8ndda',
        name: '했다',
        value: {
          '1': {
            u: 'った',
            ku: 'いた',
            gu: 'いだ',
            su: 'した',
            tsu: 'った',
            nu: 'んだ',
            mu: 'んだ',
            ru: 'った',
            bu: 'んだ',
          },
          '2': {
            ru: 'た',
          },
          '3': { suru: 'した' },
        },
      },
      {
        id: 'z293l0bjzsgg3wg',
        name: '안했다',
        value: {
          '1': {
            u: 'わなかった',
            ku: 'かなかった',
            gu: 'がなかった',
            su: 'さなかった',
            tsu: 'たなかった',
            nu: 'ななかった',
            hu: 'はなかった',
            mu: 'まなかった',
            ru: 'らなかった',
            bu: 'ばなかった',
          },
          '2': {
            ru: 'なかった',
          },
          '3': { suru: 'しなかった' },
        },
      },
      {
        id: 'p03cc4ihpxtvv3c',
        name: '했습니다',
        value: {
          '1': {
            u: 'いました',
            ku: 'きました',
            gu: 'ぎました',
            su: 'しました',
            tsu: 'ちました',
            nu: 'にました',
            hu: 'ひました',
            mu: 'みました',
            ru: 'りました',
            bu: 'びました',
          },
          '2': {
            ru: 'ました',
          },
          '3': { suru: 'しました' },
        },
      },
      {
        id: '3oxm397qrhhd0dj',
        name: '안했습니다',
        value: {
          '1': {
            u: 'いませんでした',
            ku: 'きませんでした',
            gu: 'ぎませんでした',
            su: 'しませんでした',
            tsu: 'ちませんでした',
            nu: 'にませんでした',
            hu: 'ひませんでした',
            mu: 'みませんでした',
            ru: 'りませんでした',
            bu: 'びませんでした',
          },
          '2': {
            ru: 'ませんでした',
          },
          '3': { suru: 'しませんでした' },
        },
      },
      {
        id: 'eyn3m5t0f82gsg9',
        name: '하고싶었다',
        value: {
          '1': {
            u: 'いたかった',
            ku: 'きたかった',
            gu: 'ぎたかった',
            su: 'したかった',
            tsu: 'ちたかった',
            nu: 'にたかった',
            hu: 'ひたかった',
            mu: 'みたかった',
            ru: 'りたかった',
            bu: 'びたかった',
          },
          '2': {
            ru: 'たかった',
          },
          '3': { suru: 'したかった' },
        },
      },
      {
        id: 'q113h1x2mn0m5gz',
        name: '하고싶지않았다',
        value: {
          '1': {
            u: 'いたくなかった',
            ku: 'きたくなかった',
            gu: 'ぎたくなかった',
            su: 'したくなかった',
            tsu: 'ちたくなかった',
            nu: 'にたくなかった',
            hu: 'ひたくなかった',
            mu: 'みたくなかった',
            ru: 'りたくなかった',
            bu: 'びたくなかった',
          },
          '2': {
            ru: 'たくなかった',
          },
          '3': { suru: 'したくなかった' },
        },
      },
    ],
  },
  {
    name: '미래형',
    key: 'future',
    value: [],
  },
  {
    name: '수동태',
    key: 'passive',
    value: [
      {
        id: 'i6fqpkb5qi0vndf',
        name: '수동태 기본 과거 반말',
        value: {
          '1': {
            u: 'われた',
            ku: 'かれた',
            gu: 'がれた',
            su: 'された',
            tsu: 'たれた',
            nu: 'なれた',
            mu: 'まれた',
            ru: 'られた',
            bu: 'ばれた',
          },
          '2': {
            ru: 'られた',
          },
          '3': { suru: 'された' },
        },
      },
      {
        id: 'nnt60ppwlqf1iqd',
        name: '수동태 기본 반말',
        value: {
          '1': {
            u: 'われる',
            ku: 'かれる',
            gu: 'がれる',
            su: 'される',
            tsu: 'たれる',
            nu: 'なれる',
            mu: 'まれる',
            ru: 'られる',
            bu: 'ばれる',
          },
          '2': {
            ru: 'られる',
          },
          '3': { suru: 'される' },
        },
      },
    ],
  },
  {
    name: '命令形',
    key: 'imperative',
    value: [
      {
        id: '',
        name: '하지 말아주세요',
        value: {
          '1': {
            u: 'わないでください',
            ku: 'かないでください',
            gu: 'がないでください',
            su: 'さないでください',
            tsu: 'たないでください',
            nu: 'なないでください',
            mu: 'まないでください',
            ru: 'らないでください',
            bu: 'ばないでください',
          },
          '2': {
            ru: 'ないでください',
          },
          '3': { suru: 'しないでください' },
        },
      },
      {
        id: 'e4hkv8111lofy5x',
        name: '하면 안 된다',
        value: {
          '1': {
            u: 'ってはいけない',
            ku: 'いてはいけない',
            gu: 'いではいけない',
            su: 'してはいけない',
            tsu: 'ってはいけない',
            nu: 'んではいけない',
            mu: 'んではいけない',
            ru: 'ってはいけない',
            bu: 'んではいけない',
          },
          '2': {
            ru: 'てはいけない',
          },
          '3': { suru: 'してはいけない' },
        },
      },
      {
        id: '1p9gy6wzxexgi9t',
        name: '해라',
        value: {
          '1': {
            u: 'って',
            ku: 'いて',
            gu: 'いで',
            su: 'して',
            tsu: 'って',
            nu: 'んで',
            mu: 'んで',
            ru: 'って',
            bu: 'んで',
          },
          '2': {
            ru: 'て',
          },
          '3': { suru: 'して' },
        },
      },
    ],
  },
];
